app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'pepe'
OR `email` = 'pepe1@gmail.com'
 LIMIT 1
---
    public function register()
    {
        $user = new UserModel();
        $username = $this->request->getPost('username');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Verificar si el nombre de usuario o el correo electrónico ya existen
        $existingUser = $user->where('username', $username)
                             ->orWhere('email', $email)
                             ->first();

SELECT *
FROM `users`
WHERE `username` = 'pepe'
OR `email` = 'pepe'
 LIMIT 1
---
    public function login()
    {
        $user = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Verificar las credenciales del usuario
        $userRecord = $user->where('username', $username)
                           ->orWhere('email', $username)
                           ->first();